Repository: Haruma-VN/Sen
Catalog: Engine/lib/l10n/app_*.arb
Languages: es, pt, vi, zh

# subgroup_size_zero
source: Property "subgroup" must have size 0 with simple
es: La propiedad "subgroup" debería tener tamaño 0 con simple
pt: Property "subgroup" ter de ter size 0 com simple
vi: Thuộc tính "subgroup" phải có kích thước bằng 0 với đối tượng đơn giản
zh: 属性“subgroup”的大小必须为0

source: slot_count cannot be null
es: slot_count no puede ser nulo
pt: slot_count não pode ser null
vi: slot_count không thể là giá trị null
zh: "slot_count"不能为null

# resource_must_be_null
source: "resources" must be null in composite object
es: "resources" debería ser null objecto composite
pt: "resources" tem de ser null em objeto composite
vi: "resources" phải là giá trị null trong đối tượng composite
zh: "resources"复合对象中必须为null

# path_must_be_string
source: Property "path" must be string
es: La propiedad "path" debería ser un texto
pt: Propriedade "path" tem de ser string
vi: Thuộc tính "path" phải là chuỗi
zh: "path"必须是字符串

# invalid_rton_magic
source: Invalid RTON Magic, should begins with "RTON"
es: RTON Magic inválido, debería de empezar con "RTON"
pt: Número mágico de RTON inválido, deveria começar com "RTON"
vi: Mã RTON không hợp lệ, phải bắt đầu bằng "RTON"
zh: RTON模块无效，应以开头"RTON"

# non_support_bnk_version
source: Unsupported Soundbank version
es: Soundbank version no soportado
pt: Versão de Soundbank não suportada
vi: Phiên bản Soundbank không được hỗ trợ
zh: 不支持的Soundbank版本

# rsbpatch_only_for_pvz2
source: RSB-Patch only support PvZ2
es: RSB-Patch solo es para PvZ2
pt: RSB-Patch só suporta PvZ2
vi: RSB-Patch chỉ hỗ trợ PvZ2
zh: RSB修补程序仅支持PvZ2

source: Raw Packet is not supported
es: Raw Packet no soportado
pt: Raw Packet não é suportado
vi: Raw Packet không được hỗ trợ
zh: 不支持原始数据包

source: Invalid MD5 Data
es: MD5 Data inválido
pt: Dados MD5 inválidos
vi: Dữ liệu MD5 không hợp lệ
zh: MD5数据无效

source: Invalid Packet Name
es: Packet Name inválido
pt: Nome de Packet inválido
vi: Tên Packet không hợp lệ
zh: 数据包名称无效

# this_rsb_is_invalid
source: This RSB is invalid to use RSB-Patch
es: Este RSB es inválido para usar RSB-Patch
pt: RSB-Patch não pode ser utilizado neste RSB, pois este é inválido
vi: RSB này không hợp lệ để sử dụng RSB-Patch
zh: 此RSB无法使用RSB修补程序

# invalid_patch_file
source: Invalid Diff Patch file
es: Archivo Diff Patch inválido
pt: Ficheiro Diff Patch inválido
vi: Tệp Patch Diff không hợp lệ
zh: 无效的Diff修补程序文件

# extend_pvz2c_texture_information
source: Extend the texture information for PvZ2C
es: Extender la información de texturas para PvZ2C
pt: Extender a informação de textura para PVZ2C
vi: Mở rộng thông tin về hình ảnh cho PvZ2 phiên bản Trung Quốc
zh: 扩展PvZ2C的纹理信息

# do_not_select_if_you_not_modding_2c
source: Do not select if you not modding PvZ2C
es: No seleccionar si no modificas PvZ2C
pt: Não seleciones se não estás a modificar PvZ2C
vi: Không chọn nếu bạn không sửa đổi PvZ2C
zh: 如果您没有修改PvZ2C，请不要选择

# encrypt_rton
source: Encrypt RTONs
es: Encriptar RTONs
pt: Encriptar RTONs
vi: Mã hóa RTONs
zh: 加密 RTON

source: Use Res-Info
es: Usar Res-Info
pt: Utilizar Res-Info
vi: Sử dụng Res-Info
zh: 使用 Res-Info

# encrypt_rton_title
source: JSONs inside PACKAGES after converted to RTONs will be encrypted
es: Los JSON dentro de PACKAGES serán encriptados luego de ser convertidos en RTON
pt: Os JSONs dentro de PACKAGES serão encriptados após serem convertidos para RTONs
vi: Các tệp JSON bên trong PACKAGES sau khi được chuyển đổi thành RTONs sẽ được mã hóa
zh: 转换为 RTON 后，PACKAGES 内的 JSON 将被加密

# use_res_info_title
source: Choose to use Res-Info or Resource-Group when pack RSB
es: Escoge si usar Res-Info ó Resource-Group al empacar el RSB
pt: Escolher entre utilizar Res-Info ou Resource-Group no processo de empacotar o RSB
vi: Chọn sử dụng Res-Info hoặc Resource-Group khi đóng gói RSB
zh: 打包 RSB 时选择使用 Res-Info 或 Resource-Group

source: Before file
es: Archivo anterior
pt: Ficheiro anterior
vi: Tệp trước
zh: 文件前

source: After file
es: Archivo posterior
pt: Ficheiro posterior
vi: Tệp sau
zh: 文件后

source: Patch File
es: Archivo parche
pt: Ficheiro de Patch
vi: Tệp Patch
zh: 补丁文件

source: Unsupported texture format
es: Formato de textura no soportado
pt: Formato de textura não suportado
vi: Định dạng hình ảnh không được hỗ trợ
zh: 不支持纹理格式

source: Select texture format
es: Selecciona un formato de textura
pt: Selecione um formato de textura
vi: Chọn định dạng hình ảnh
zh: 选择一种纹理格式

# choose_fmt_to_process
source: Choose format to process
es: Escoge un formato para procesar
pt: Escolha o formato para processar
vi: Chọn định dạng để xử lý
zh: 选择处理格式

source: Input width
es: Ingrese ancho
pt: Insira a largura
vi: Chiều rộng đầu vào
zh: 输入宽度

source: Input height
es: Ingrese altura
pt: Insira a altura
vi: Chiều cao đầu vào
zh: 输入高度

source: Argument Obtained:
es: Argumento obtenido:
pt: Argumento Obtido:
vi: Đối số đã được thu thập:
zh: 获得的论据:

source: Argument Output:
es: Argumento de salida:
pt: Argumento de Saída:
vi: Đối số đầu ra:
zh: 参数输出:

source: Waiting...
es: Esperando...
pt: Aguardando...
vi: Đang chờ...
zh: 等待...

# argument_load
source: Argument Loaded:
es: Argumento cargado:
pt: Argumento Carregado:
vi: Đối số Đã nạp:
zh: 加载方法:

# command_execute_finish
source: Command executed finish!
es: ¡Ejecución de comando terminado!
pt: Execução do comando terminada!
vi: Lệnh đã thực thi xong!
zh: 命令执行完毕！

source: Stack for traceback:
es: Stack para el rastreo:
pt: Stack de Rastreamento:
vi: Ngăn xếp cho việc truy vết:
zh: 回溯到错误的堆栈:

source: Execution error:
es: Error de ejecución:
pt: Erro de Executação:
vi: Lỗi thực thi:
zh: 执行错误:

# file_exists_sen_will_override_it
source: Execution Warning: File already exists, Sen will override it
es: Advertencia de ejecución: El archivo ya existe, Sen lo sobreescribirá
pt: Aviso de Execução: Ficheiro já existe, Sen vai substituí-lo
vi: Cảnh báo thực thi: Tệp đã tồn tại, Sen sẽ ghi đè lên nó
zh: 执行警告: 文件已经存在

# folder_exists_sen_will_override_it
source: Execution Warning: Directory already exists, file inside will be override
es: Advertencia de ejecución: El directorio ya existe, los archivos dentro serán sobreescribidos
pt: Aviso de Execução: Diretório já existe, os ficheiros dentro vão ser substituídos
vi: Cảnh báo thực thi: Thư mục đã tồn tại, các tệp bên trong sẽ bị ghi đè
zh: 执行警告: 目录已经存在

source: All arguments have been executed!
es: ¡Todos los argumentos han sido ejecutado!
pt: Todos os argumentos foram executados!
vi: Tất cả đối số đã được thực thi!
zh: 所有命令都已成功执行！

source: Execution Finish:
es: Ejecución terminada:
pt: Execução Terminada:
vi: Kết thúc thực thi:
zh: 执行结束:

source: Texture Format:
es: Formato de textura:
pt: Formato de Textura:
vi: Định dạng hình ảnh:
zh: 纹理格式:

# sheet_width
source: Spritesheet width:
es: Ancho de Spritesheet:
pt: Largura do Spritesheet:
vi: Chiều rộng bảng Sprite:
zh: Spritesheet 宽度:

# sheet_height
source: Spritesheet height:
es: Altura de Spritesheet:
pt: Altura do Spritesheet:
vi: Chiều cao bảng Sprite:
zh: Spritesheet 高度:

source: Encryption IV:
es: Encripción IV:
pt: Encriptação IV:
vi: IV đến từ Khoá Mã Hoá:
zh: 加密 IV:

# sheet_padding
source: Spritesheet padding
es: Relleno de Spritesheet
pt: Espaçamento do Spritesheet
vi: Khoảng trống bảng Sprite
zh: Spritesheet 填充

source: DONE
es: HECHO
pt: FEITO
vi: HOÀN THÀNH
zh: 完成

source: Provide media folder
es: Dar carpeta media
pt: Insira o diretório de mídia ("media")
vi: Cung cấp thư mục phương tiện

source: All Sprites loaded
es: Sprites cargados
pt: Todos os sprites foram carregados
vi: Tất cả Sprite đã được nạp

# animation_render_use_image_by_path
source: Sprite name set by media option
es: Nombre del sprite establecido por opción de medios
pt: Nomes de Sprites definidos pelo diretório de mídia
vi: Tên Sprite được đặt bằng tùy chọn phương tiện

# use_image_by_id
source: Import media with property "id"
es: Importar media con la propiedad "id"
pt: Importar mídia com propriedade "id"
vi: Nhập phương tiện với thuộc tính "id"

# use_image_by_path
source: Import media with property "path"
es: Importar media con la propiedad "path"
pt: Importar mídia com propriedade "path"
vi: Nhập phương tiện với thuộc tính "path"

# animation_render_disable_sprite_method
source: Disable Sprite
es: Desactivar Sprite
pt: Desativar Sprite
vi: Tắt Sprite

source: Enable all Sprites
es: Activar todos los sprites
pt: Ativar todos os Sprites
vi: Bật tất cả Sprite

source: Disable all Sprites
es: Desactivar todos los sprites
pt: Desativar todos os Sprites
vi: Tắt tất cả Sprite

# choose_sprite_to_disable
source: Select Sprites to disable
es: Seleccionar sprites a deshabilitar
pt: Selecione os Sprites para desativar
vi: Chọn Sprite để tắt

# provide_sprite_directory
source: Provide splitted Sprite directory obtained by Split Atlas
es: Dar directorio de sprites separados obtenido por Separar Atlas
pt: Insira o diretório dos Sprite separados obtidos por "Separar Atlas"
vi: Cung cấp thư mục Sprite chia thành Atlas

# enter_number_of_sprite_to_disable
source: Input Sprite index to disable, input 0 to finish...
es: Ingrese el index del sprite para desactivar, ingrese 0 para terminar...
pt: Insira o index do Sprite para desativar, insira 0 para terminar...
vi: Nhập chỉ số Sprite để tắt, nhập 0 để kết thúc...

source: Sprite already selected
es: Sprite ya seleccionado
pt: Sprite já foi selecionado
vi: Sprite đã được chọn

source: Command executed success!
es: ¡Ejecución de comando con éxito!
pt: Comando executado com sucesso!
vi: Lệnh được thực thi thành công!

# popcap_animation_render
source: PopCap Animation: Animation Render from PAM.json
es: PopCap Animation: Renderizar animación usando PAM.json
pt: PopCap Animação: Render de animação a partir de PAM.json
vi: PopCap Animation: Render Animation từ PAM.json

# append_width_input
source: Input append width
es: Ingrese ancho de append
pt: Insira a largura de append
vi: Nhập chiều rộng bổ sung

# append_height_input
source: Input append height
es: Ingrese altura de append
pt: Insira a altura de append
vi: Nhập chiều cao bổ sung

# posx_input
source: Input positition x
es: Ingerse posición x
pt: Insira posição x
vi: Nhập vị trí x

# posy_input
source: Input positition y
es: Ingrese posición y
pt: Insira posição y
vi: Nhập vị trí y

source: second
es: segundo
pt: segundo
vi: giây

source: seconds
es: segundos
pt: segundos
vi: giây

source: minute
es: minuto
pt: minuto
vi: phút

source: minutes
es: minutos
pt: minutos
vi: phút

source: hour
es: hora
pt: hora
vi: giờ

source: hours
es: horas
pt: horas
vi: giờ

# special_thanks
source: Special thanks to: Vi (Russian translation), PPP (Vietnamese translation), JNR (Spanish translation), Allah (Portuguese translation)
es: Agradecimientos especiales a: Vi (traducción al ruso), PPP (traducción al vietnamita), JNR (traducción al español), Allah (traducción al portugués)
pt: Agradecimentos especiais para: Vi (Tradução russa), PPP (Tradução vietnamesa), JNR (Tradução espanhola), Allah (Tradução portuguesa)
vi: Trân trọng cảm ơn: Vi (Bản dịch tiếng Nga), PPP (Bản dịch tiếng Việt), JNR (Bản dịch tiếng Tây Ban Nha), Allah (Bản dịch tiếng Bồ Đào Nha)
zh: Special thanks to: Vi (Russian translation), PPP (Vietnamese translation), JNR (Spanish translation), Allah (Portuguese translation), Snap (Chinese translation)

# translator_author
source: Haruma-VN
es: JNR
pt: Allahbird | Discord: allahbird
zh: Snap
