Repository: Haruma-VN/Sen
Catalog: Engine/lib/l10n/app_*.arb
Languages: es, pt, vi, zh

# command_page
source: Commands
es: Commandos
pt: Comandos
vi: Lệnh
zh: 命令

# setting_page
source: Settings
es: Ajustes
pt: Definições
vi: Cài Đặt
zh: 设置

source: Have not implemented
es: Aún no ha sido implementado
pt: Não implementado
vi: Chưa cải thiện
zh: 尚未实施

source: PopCap Resource-Group: Split
es: PopCap Resource-Group: Separar
pt: PopCap Resource-Group: Separar
vi: PopCap Resource-Group: Tách
zh: PopCap Resource-Group: 拆分

# popcap_resource_group_split_subtitle
source: This function will help you split resources.json to a directory
es: Esta función te ayudará a separar un resources.json en un directorio
pt: Transforma Resources.json num diretório
vi: Hàm này sẽ giúp bạn tách resources.json thành một thư mục
zh: 此函数将帮助您将resources.json拆分到一个目录

source: PopCap Resource-Group: Merge
es: PopCap Resource-Group: Juntar
pt: PopCap Resource-Group: Unir
vi: PopCap Resource-Group: Hợp Nhất
zh: PopCap Resource-Group: 合并

# popcap_resource_group_merge_subtitle
source: This function will give you resources.json from a directory
es: Esta función te dará un resources.json de un directorio
pt: Une um diretório Resource-Group de volta para Resources.json
vi: Hàm này tái tạo lại resources.json từ thư mục
zh: 此函数将从目录中为您提供resources.json

source: PopCap Resource-Group: To Res-Info
es: PopCap Resource-Group: Convertir a Res-Info
pt: PopCap Resource-Group: Converter para Res-Info
vi: PopCap Resource-Group: Sang Res-Info
zh: PopCap Resource-Group: 至Res信息

# popcap_resource_group_to_resinfo_subtitle
source: Through Res-Info, editing resources simpler
es: Res-Info te ayuda a editar resources de manerá mas simple
pt: Res-Info permite editar Resources muito mais facilmente do que na Estrutura Resource-Group
vi: Thông qua Res-Info, sửa resources đơn giản hơn
zh: 通过Res Info，编辑资源更简单

source: PopCap Resource-Group: From Res-Info
es: PopCap Resource-Group: Convertir usando Res-Info
pt: PopCap Resource-Group: Converter de Res-Info
vi: PopCap Resource-Group: Từ Res-Info
zh: PopCap Resource-Group: 来自资源信息

# popcap_resource_group_from_resinfo_subtitle
source: After edit Res-Info, must merge to Resource-Group before launch
es: Después de editar el Res-Info, debe convertirlo a un Resource-Group antes de empacar
pt: Depois de editar Res-Info, é necessário converter para Resource-Group antes de empacotar o RSB
vi: Sau khi sửa Res-Info, chuyển hoá thành Resource-Group trước khi chạy
zh: 编辑资源信息后，必须在启动前合并到资源组

source: PopCap Res-Info: Split
es: PopCap Res-Info: Separar
pt: PopCap Res-Info: Separar
vi: PopCap Res-Info: Tách
zh: PopCap Res-Info: 拆分

# popcap_resinfo_split_subtitle
source: This function will help you split res.json to a directory
es: Esta función te ayudará a separar el res.json en un directorio
pt: Transforma Res.json num diretório
vi: Hàm này sẽ giúp bạn tách res.json thành một thư mục
zh: 此函数将帮助您将res.json拆分到一个目录

source: PopCap Res-Info: Merge
es: PopCap Res-Info: Juntar
pt: PopCap Res-Info: Unir
vi: PopCap Res-Info: Hợp Nhất
zh: PopCap Res-Info: 合并

# popcap_resinfo_merge_subtitle
source: This function will give you res.json from a directory
es: Esta función te dara un res.json de un directorio
pt: Une um diretório Res-Info de volta para Res.json
vi: Hàm này sẽ cho bạn res.json từ một thư mục
zh: 此函数将从目录中为您提供res.json

# popcap_resource_group_split_atlas
source: PopCap Atlas: Split with Resource-Group Structure
es: PopCap Atlas: Separar con Resource-Group
pt: PopCap Atlas: Separar com Estrutura Resource-Group
vi: PopCap Atlas: Tách bằng cấu trúc Resource-Group
zh: PopCap Atlas: 使用资源组结构拆分

# popcap_resource_group_split_atlas_subtitle
source: Through split atlas, obtain sprite directory to work with
es: Conseguirás un directorio con sprites
pt: Converte o Atlas para um diretório com todos os sprites, através da Estrutura Resource-Group
vi: Thông qua tách atlas, nhận được thư mục sprite dễ dàng hoạt động
zh: 通过拆分图集，获得sprite目录

# popcap_resource_group_merge_atlas
source: PopCap Atlas: Merge with Resource-Group Structure
es: PopCap Atlas: Juntar con Resource-Group
pt: PopCap Atlas: Unir com Estrutura Resource-Group
vi: PopCap Atlas: Hợp nhất bằng cấu trúc Resource-Group
zh: PopCap Atlas: 与资源组结构合并

# popcap_resource_group_merge_atlas_subtitle
source: Through merge atlas, obtain working spritesheet in-game
es: Conseguirás un spritesheet
pt: Converte um Atlas separado através da Estrutura Resource-Group para um spritesheet
vi: Thông qua hợp nhất atlas, nhận được spritesheet có thể sử dụng trong game
zh: 通过合并图谱，获得游戏中的 Spritesheet

# popcap_resinfo_split_atlas
source: PopCap Atlas: Split with Res-Info Structure
es: PopCap Atlas: Separar con Res-Info
pt: PopCap Atlas: Separar com Estrutura Res-Info
vi: PopCap Atlas: Tách với cấu trúc Res-Info
zh: PopCap Atlas: 与 Res-Info 结构拆分

# popcap_resinfo_split_atlas_subtitle
source: Through split atlas, obtain sprite directory to work with
es: Conseguirás un directorio con sprites
pt: Converte o Atlas para um diretório com todos os sprites, através da Estrutura Res-Info
vi: Thông qua tách atlas, nhận được thư mục sprite dễ dàng hoạt động
zh: 通过拆分图集，获得sprite目录

# popcap_resinfo_merge_atlas
source: PopCap Atlas: Merge with Res-Info Structure
es: PopCap Atlas: Juntar con Res-Info
pt: PopCap Atlas: Unir com Estrutura Res-Info
vi: PopCap Atlas: Hợp Nhất với cấu trúc Res-Info
zh: PopCap Atlas: 与 Res-Info 结构合并

# popcap_resinfo_merge_atlas_subtitle
source: Through merge atlas, obtain working spritesheet in-game and json
es: Conseguirás un spritesheet y un json
pt: Converte um Atlas separado através da Estrutura Res-Info para um spritesheet
vi: Thông qua hợp nhất atlas, nhận được spritesheet có thể sử dụng trong game
zh: 通过合并图谱，获得游戏中的 Spritesheet

source: PopCap PTX: Decode
es: PopCap PTX: Decodificar
pt: PopCap PTX: Decodificar
vi: PopCap PTX: Giải Mã
zh: PopCap PTX: 解码

# popcap_ptx_decode_subtitle
source: Through decode PTX, obtain PNG to view
es: Conseguirás un PNG para previsualizar
pt: Converte um PTX para PNG
vi: Thông qua giải mã PTX, nhận được PNG có thể xem
zh: 通过解码PTX，获得PNG查看

source: PopCap PTX: Encode
es: PopCap PTX: Codificar
pt: PopCap PTX: Codificar
vi: PopCap PTX: Mã Hoá
zh: PopCap PTX: 编码

# popcap_ptx_encode_subtitle
source: Through encode PTX, obtain PTX to pack RSG and use in-game
es: Conseguirás un PTX para empacar un RSG y usarlo en el juego
pt: Converte um PNG para PTX, para poder ser empacotado num RSG e utilizado no jogo
vi: Thông qua mã hoá PTX, nhận được PTX để sử dụng trong game
zh: 通过编码PTX，获得PTX以打包RSG并在游戏中使用

# popcap_animation_decode_to_json
source: PopCap Animation: To JSON
es: PopCap Animation: Convertir a JSON
pt: PopCap Animação: Converter para JSON
vi: PopCap Animation: Sang JSON
zh: PopCap Animation: 到JSON

# popcap_animation_decode_to_json_subtitle
source: Convert PAM to JSON, mostly for view animation
es: Convierte el PAM a JSON, mayormente para ver las animaciones
pt: Converte PAM para JSON, maioritariamente para visualizar a animação
vi: Chuyển đổi PAM sang JSON, thường để xem hoạt ảnh
zh: 将PAM转换为JSON，主要用于视图动画

# popcap_animation_encode_from_json
source: PopCap Animation: From JSON
es: PopCap Animation: Covertir usando un JSON
pt: PopCap Animação: Converter de JSON
vi: PopCap Animation: Từ JSON
zh: PopCap Animation: 来自JSON

# popcap_animation_encode_from_json_subtitle
source: Convert PAM from JSON
es: Convierte el JSON a PAM
pt: Converte um JSON obtido de uma PAM de volta para PAM
vi: Chuyển đổi PAM từ JSON
zh: 从JSON转换PAM

# popcap_animation_pam_to_flash
source: PopCap Animation: To Flash
es: PopCap Animation: Convertir a Flash
pt: PopCap Animação: Converter para Flash
vi: PopCap Animation: Sang Flash
zh: PopCap Animation: 从JSON转换PAM

# popcap_animation_pam_to_flash_subtitle
source: Through convert PAM to Flash, you can view and edit animation in Animate Adobe
es: Conseguirás un archivo flash para ver y editar las animaciones usando Animate Adobe
pt: Converte uma PAM para Animação Adobe Animate
vi: Thông qua PAM sang Flash, bạn có thể xem và chỉnh sửa hoạt ảnh thông qua Animate Adobe
zh: 通过将PAM转换为Flash，您可以在Animate Adobe中查看和编辑动画

# popcap_animation_pam_from_flash
source: PopCap Animation: From Flash
es: PopCap Animation: Convertir usando Flash
pt: PopCap Animação: Converter de Flash
vi: PopCap Animation: Từ Flash
zh: PopCap Animation: 来自Flash包

# popcap_animation_pam_from_flash_subtitle
source: Through convert Flash to PAM, obtain PAM to use in-game
es: Conseguirás un PAM para usarlo en el juego
pt: Converte uma Animação Adobe Flash para PAM, para poder ser utilizada no jogo
vi: Thông qua chuyển đổi Flash sang PAM, nhận được PAM để sử dụng trong game
zh: 通过将Flash转换为PAM，获得PAM在游戏中使用

source: PopCap Animation: JSON To Flash
es: PopCap Animation: JSON a Flash
pt: PopCap Animação: Converter JSON para Flash
vi: PopCap Animation: JSON sang Flash
zh: PopCap Animation: JSON到Flash包

# popcap_animation_json_to_flash_subtitle
source: Through convert JSON to Flash, you can view and edit animation in Animate Adobe
es: Conseguirás un archivo flash para ver y editar las animaciones usando Animate Adobe
pt: Converte um JSON de Animação para Animação Adobe Animate, onde é possível visualizar e editar a animação no Adobe Animate
vi: Thông qua chuyển đổi JSON sang Flash, bạn có thể xem và sửa đổi hoạt ảnh thông qua Animate Adobe
zh: 通过将JSON转换为Flash，您可以在Animate Adobe中查看和编辑动画

source: PopCap Animation: JSON From Flash
es: PopCap Animation: Flash a JSON
pt: PopCap Animação: Converter JSON de Flash
vi: PopCap Animation: JSON từ Flash
zh: PopCap Animation: 来自Flash包的JSON

# popcap_animation_json_from_flash_subtitle
source: Through convert Flash to JSON, obtain JSON to view animation
es: Conseguirás un JSON para ver las animaciones
pt: Converte uma Animação Adobe Animate para um JSON de animação, onde é possível visualizar a animação
vi: Thông qua chuyển đổi Flash sang JSON, nhận được JSON để xem hoạt ảnh
zh: 通过将Flash转换为JSON，获得JSON来查看动画

# popcap_rton_decode
source: PopCap RTON: To JSON
es: PopCap RTON: Convertir a JSON
pt: PopCap RTON: Decodificar
vi: PopCap RTON: Sang JSON
zh: PopCap RTON: 到JSON

# popcap_rton_decode_subtitle
source: Through RTON decode, obtain JSON for easily edit
es: Conseguirás un JSON para editarlo fácilmente
pt: Converte um RTON para JSON, para poder ser facilmente editado
vi: Thông qua xử lý RTON, nhận được JSON để dễ dàng sửa đổi
zh: 通过RTON解码，获得易于编辑的JSON

# popcap_rton_encode
source: PopCap RTON: From JSON
es: PopCap RTON: Convertir usando un JSON
pt: PopCap RTON: Codificar
vi: PopCap RTON: Từ JSON
zh: PopCap RTON: 来自JSON

# popcap_rton_encode_subtitle
source: Through RTON encode, obtain RTON for game process
es: Conseguirás un RTON para los procesos del juego
pt: Converte um JSON para RTON, para poder ser utilizado no jogo
vi: Thông qua xử lý RTON, nhận được RTON cho game xử lý
zh: 通过RTON编码，获得游戏过程的RTON

source: PopCap RTON: Decrypt
es: PopCap RTON: Desencriptar
pt: PopCap RTON: Desencriptar
vi: PopCap RTON: Giải Mã
zh: PopCap RTON: 解密

# popcap_rton_decrypt_subtitle
source: Through RTON decrypt, obtain PvZ2 Chinese decrypted RTON
es: Conseguirás un archivo RTON desencriptado de PvZ2 China
pt: Desencripta um RTON encriptado do PvZ2 Chinês
vi: Thông qua giải mã RTON, nhận được RTON giải mã cho PvZ2 bản Trung Quốc
zh: 通过RTON解密，获得PvZ2中文解密RTON

source: PopCap RTON: Encrypt
es: PopCap RTON: Encriptar
pt: PopCap RTON: Encriptar
vi: PopCap RTON: Mã Hoá
zh: PopCap RTON: 加密

# popcap_rton_encrypt_subtitle
source: Through RTON encrypt, obtain PvZ2 Chinese encrypted RTON
es: Conseguirás un archivo RTON encriptado de PvZ2 China
pt: Encripta um RTON normal para um RTON do PvZ2 Chinês
vi: Thông qua mã hoá RTON, nhận được tệp RTON mã hoá cho PvZ2 bản Trung Quốc
zh: 通过RTON加密，获得PvZ2中文加密RTON

source: PopCap RTON: Decrypt and Decode
es: PopCap RTON: Desencriptar y Decodificar
pt: PopCap RTON: Desencriptar e Decodificar
vi: PopCap RTON: Giải Mã và chuyển sang JSON
zh: PopCap RTON: 解密和解码

# popcap_rton_decrypt_and_decode_subtitle
source: Through RTON decrypt and decode, obtain JSON for easily edit
es: Conseguirás un JSON para editarlo fácilmente
pt: Converte um RTON encriptado do PvZ2 Chinês para um JSON, para poder ser facilmente editado
vi: Thông qua RTON giải mã và chuyển sang JSON, nhận được JSON để dễ dàng sửa đổi
zh: 通过RTON解密和解码，获得易于编辑的JSON

source: PopCap RTON: Encode and Encrypt
es: PopCap RTON: Codificar y Encriptar
pt: PopCap RTON: Codificar e Encriptar
vi: PopCap RTON: Chuyển sang RTON và Mã Hoá
zh: PopCap RTON: 编码和加密

# popcap_rton_encode_and_encrypt_subtitle
source: Through RTON encode and encrypt, obtain RTON for PvZ2 Chinese
es: Conseguirás un archivo RTON encriptado de PvZ2 China
pt: Converte um JSON para um RTON encriptado do PvZ2 Chinês, para poder ser utilizado no jogo
vi: Thông qua RTON chuyển sang RTON và Mã Hoá, nhận được RTON cho PvZ2 bản Trung Quốc
zh: 通过RTON编码和加密，获得PvZ2中文版的RTON

source: PopCap RSG: Unpack
es: PopCap RSG: Desempacar
pt: PopCap RSG: Desempacotar
vi: PopCap RSG: Giải Nén
zh: PopCap RSG: 打开

# popcap_rsg_unpack_subtitle
source: Through RSG Unpack, obtain actual game resource
es: Conseguirás los recursos del juego
pt: Converte um RSG para um diretório com o conteúdo deste RSG
vi: Thông qua giải nén RSG, nhận được tài nguyên của game
zh: 通过RSG Unpack获取实际游戏资源

source: PopCap RSG: Pack
es: PopCap RSG: Empacar
pt: PopCap RSG: Empacotar
vi: PopCap RSG: Nén
zh: PopCap RSG: 收拾

# popcap_rsg_pack_subtitle
source: Through RSG Pack, zipping game resource for pack RSB
es: Conseguirás un archivo comprimido para empacarlo en el RSB
pt: Converte o diretório de um RSG desempacotado para RSG, comprimindo o conteúdo do RSG para poderem ser utilizados quando o RSB for empacotado
vi: Thông qua nén RSG, nén tài nguyên để đóng gói RSB
zh: 通过RSG包，压缩包RSB的游戏资源

source: PopCap RSB: Unpack
es: PopCap RSB: Desempacar
pt: PopCap RSB: Desempacotar
vi: PopCap RSB: Giải Nén
zh: PopCap RSB: 打开

# popcap_rsb_unpack_subtitle
source: Through RSB Unpack, obtain directory of game content as compressed RSG
es: Conseguirás un directorio del contenido del juego como archivos RSG
pt: Converte um RSB para um diretório (bundle) com todos os recursos deste RSB
vi: Thông qua giải nén RSB, nhận được thư mục của tài nguyên game dưới dạng RSG
zh: 通过RSB Unpack，获得游戏内容的目录作为压缩的RSG

source: PopCap RSB: Pack
es: PopCap RSB: Empacar
pt: PopCap RSB: Empacotar
vi: PopCap RSB: Nén
zh: PopCap RSB: 收拾

# popcap_rsb_pack_subtitle
source: Through RSB Pack, obtain RSB to launch in game
es: Conseguirás un RSB para usarlo en el juego
pt: Converte uma bundle para RSB
vi: Thông qua nén RSB, nhận được RSB để chạy trong game
zh: 通过RSB包，获得RSB在游戏中启动

# popcap_rsb_unpack_simple
source: PopCap RSB: Unpack for Modding
es: PopCap RSB: Desempacar para modificar
pt: PopCap RSB: Desempacotar (Simples)
vi: PopCap RSB: Giải nén cho Modding
zh: PopCap RSB: 解包进行改装

# popcap_rsb_unpack_simple_subtitle
source: Through RSB Unpack for Modding, unpack Package and Manifest easier to process
es: Desempaca de manera más simple el Package y el Manifest para procesar
pt: Converte um RSB para um diretório (bundle) simples com todos os recursos deste RSB, desempacotando também Packages e Manifest para facilitar a edição destes
vi: Thông qua giải nén RSB cho Modding, giải nén Package và Manifest dễ dàng hơn để xử lý
zh: 通过RSB Unpack进行修改，更容易处理解包和清单

# popcap_rsb_pack_simple
source: PopCap RSB: Pack for Modding
es: PopCap RSB: Empacar para modificar
pt: PopCap RSB: Empacotar (Simples)
vi: PopCap RSB: Nén cho Modding
zh: PopCap RSB: 改装包

# popcap_rsb_pack_simple_subtitle
source: Through RSB Pack for Modding, obtain RSB with the edited data
es: Conseguirás un RSB con los datos editados
pt: Converte uma bundle simples para RSB
vi: Thông qua nén RSB cho Modding, nhận được RSB để chạy trong game
zh: 通过RSB Pack进行修改，获得具有编辑数据的RSB

source: PopCap RSB: Unpack by Loose constraints
es: PopCap RSB: Desempacar con restricciones sueltas
pt: PopCap RSB: Desempacotar com Restrições Leves
vi: PopCap RSB: Giải nén bằng các ràng buộc lỏng lẻo
zh: PopCap RSB: 按松散约束展开

# popcap_rsb_unpack_by_loose_constraints_subtitle
source: Through unpack by loose constraints, force any RSBs to be unpacked
es: Forzará cualquier RSB a ser desempacado
pt: Converte um RSB à força para uma bundle. Consegue forçar qualquer RSB a ser desempacotado (Só deve ser utilizado com RSBs corrompidos ou para debug)
vi: Thông qua giải nén bằng các ràng buộc lỏng lẻo, cưỡng chế bất kì RSBs nào phải giải nén
zh: 通过松散约束的解包，强制解包任何RSB

source: PopCap RSB: Unpack Resource
es: PopCap RSB: Desempacar recursos
pt: PopCap RSB: Desempacotar Recursos
vi: PopCap RSB: Giải nén tài nguyên
zh: PopCap RSB: 解压缩资源

# popcap_rsb_unpack_resource_subtitle
source: Through RSB Unpack Resource, unpack entire game bundle
es: Desempaca todos los archivos en un directorio
pt: Desempacota todos os recursos dentro de uma bundle
vi: Thông qua giải nén tài nguyên RSB, giải nén toàn bộ tài nguyên game
zh: 通过RSB Unpack Resource，打开整个游戏

source: PopCap RSB: Pack Resource
es: PopCap RSB: Empacar recursos
pt: PopCap RSB: Empacotar Recursos
vi: PopCap RSB: Đóng gói tài nguyên
zh: PopCap RSB: 打包资源

# popcap_rsb_pack_resource_subtitle
source: Through RSB Pack Resource, pack entire game bundle
es: Empaca todos los archivos de un directorio
pt: Empacota todos os recursos desempacotados dentro de uma bundle
vi: Thông qua đóng gói tài nguyên RSB, đóng gói toàn bộ tài nguyên game sử dụng
zh: 通过RSB Pack Resource，打包整个游戏

source: PopCap Zlib: Compress
es: PopCap Zlib: Comprimir
pt: PopCap Zlib: Comprimir
vi: PopCap Zlib: Nén
zh: PopCap Zlib: 压缩

# popcap_zlib_compress_subtitle
source: Many PopCap files are compressed zlib, such ".smf" or ".compiled"
es: Muchos archivos de PopCap están comprimidos con zlib, como ".smf" ó ".compiled"
pt: Alguns ficheiros da PopCap utilizam essa compressão, como ".smf" ou ".compiled"
vi: Nhiều tệp của PopCap được nén zlib, như ".smf" hoặc ".compiled"
zh: 许多PopCap文件都是经过zlib压缩的, 如“.smf”或“.compiled”

source: PopCap Zlib: Uncompress
es: PopCap Zlib: Descomprimir
pt: PopCap Zlib: Descomprimir
vi: PopCap Zlib: Giải nén
zh: PopCap Zlib: 取消压缩

# popcap_zlib_uncompress_subtitle
source: Many PopCap files need to be uncompressed, such ".smf" or ".compiled"
es: Muchos archivos de PopCap pueden descomprimirse, como ".smf" ó ".compiled"
pt: Alguns ficheiros da PopCap utilizam essa compressão, e precisam ser descomprimidos para serem editados, como ".smf" ou ".compiled"
vi: Nhiều tệp của PopCap cần được giải nén zlib, như ".smf" hoặc ".compiled"
zh: 许多PopCap文件需要解压缩，例如“.smf”或“.compiled”

source: WWise Soundbank: Decode
es: WWise Soundbank: Decodificar
pt: WWise Soundbank: Decodificar
vi: WWise Soundbank: Giải Mã
zh: WWise Soundbank: 解码

# wwise_soundbank_decode_subtitle
source: Through decode, obtain bnk information and perhaps wems
es: Conseguirás la información del bnk y talvéz wems
pt: Converte um BNK para um diretório contendo as suas informações e talvez as suas WEMs
vi: Thông qua giải mã, nhận được thông tin của bnk và có thể là wem
zh: 通过解码，获得bnk信息，还有wems

source: WWise Soundbank: Encode
es: WWise Soundbank: Codificar
pt: WWise Soundbank: Codificar
vi: WWise Soundbank: Mã Hoá
zh: WWise Soundbank: 编码

# wwise_soundbank_encode_subtitle
source: Through encode, bnk can be used for game process
es: Los bnk se usan para procesos del juego
pt: Converte um diretório obtido de um BNK de volta para BNK, para poder ser utilizado no jogo
vi: Thông qua mã hoá, bnk có thể được sử dụng trong game xử lý
zh: 通过编码，bnk可以用于游戏过程

source: PopCap Animation: Flash Animation Resize
es: PopCap Animation: Cambiar de tamaño a animación Flash
pt: PopCap Animação: Redimensionar Animação Flash
vi: PopCap Animation: Thay đổi kích thước hoạt ảnh Flash
zh: PopCap Animation: Flash动画调整大小

# popcap_animation_flash_animation_resize_subtitle
source: Through resize, flash project can be adjusted to correct resolution
es: Un proyecto Flash puede ser ajustado a la resolución correcta
pt: Redimensiona uma Animação Adobe Animate, permitindo que o projeto possa ser ajustado para a resolução pretendida
vi: Thông qua thay đổi kích thước, dự án flash có thể được điều chỉnh về kích thước hợp lý
zh: 通过调整大小，Flash项目可以调整到正确的分辨率

source: PopCap RSB-Patch: Decode
es: PopCap RSB-Patch: Decodificar
pt: PopCap RSB-Patch: Decodificar
vi: PopCap RSB-Patch: Giải Mã
zh: PopCap RSB-Patch: 解码

# popcap_rsbpatch_decode_subtitle
source: Through RSB-Patch Decode, obtain newly RSB file from the patch
es: Conseguirás un nuevo archivo RSB usando un parche
pt: Aplica um Patch (".diff") num RSB, criando um novo RSB
vi: Thông qua giải mã RSB-Patch, áp bản vá lên tệp RSB
zh: 通过RSB补丁解码，从补丁中获取新的RSB文件

source: PopCap RSB-Patch: Encode
es: PopCap RSB-Patch: Codificar
pt: PopCap RSB-Patch: Codificar
vi: PopCap RSB-Patch: Mã Hoá
zh: PopCap RSB-Patch: 编码

# popcap_rsbpatch_encode_subtitle
source: Through RSB-Patch Encode, obtain diff file from comparing RSB
es: Conseguirás un archivo con las diferencias entre RSB
pt: Cria um ficheiro Patch (".diff") através da comparação de 2 RSBs
vi: Thông qua mã hoá RSB-Patch, nhận được tệp diff file từ việc so sánh RSB
zh: 通过RSB补丁编码，通过比较RSB获得diff文件

# popcap_lawnstring_convert
source: PopCap Localization: Convert
es: PopCap Localization: Convertir
pt: PopCap Lawnstrings: Converter
vi: PopCap Localization: Chuyển đổi
zh: PopCap Localization: 转换

# popcap_lawnstring_convert_subtitle
source: Through Lawnstring convert, obtain working lawnstring for many PvZ2 versions
es: Conseguirás un lawnstring para muchas versiones de PvZ2
pt: Converte um Lawnstrings de uma estrutura para a outra
vi: Thông qua chuyển đổi Lawnstring, nhận đuợc lawnstring cho nhiều phiên bản PvZ2
zh: 通过Lawnstring转换，获得许多PvZ2版本的工作Lawnstring

source: PopCap Newton: Decode
es: PopCap Newton: Decodificar
pt: PopCap Newton: Decodificar
vi: PopCap Newton: Giải Mã
zh: PopCap Newton: 解码

# popcap_newton_decode_subtitle
source: Through Newton Decode, obtain resources.json to work
es: Conseguirás un resources.json
pt: Converte Resources.newton para Resources.json
vi: Thông qua giải mã Newton, nhận được resources.json để làm việc
zh: 通过Newton Decode，获取resources.json即可工作

source: PopCap Newton: Encode
es: PopCap Newton: Codificar
pt: PopCap Newton: Codificar
vi: PopCap Newton: Mã Hoá
zh: PopCap Newton: 编码

# popcap_newton_encode_subtitle
source: Through Newton Encode, obtain resources.newton for in-game
es: Conseguirás un resources.newton para usarlo en el juego
pt: Converte Resources.json para Resources.newton
vi: Thông qua mã hoá Newton, nhận được resources.newton cho game
zh: 通过Newton Encode，获得游戏中的资源。Newton

source: PopCap Compiled-Text: Decode
es: PopCap Compiled-Text: Decodificar
pt: PopCap Compiled-Text: Decodificar
vi: PopCap Compiled-Text: Giải Mã
zh: PopCap Compiled-Text: 解码

# popcap_compiled_text_decode_subtitle
source: Through Compiled-Text Decode, obtain data from lawnstring server
es: Conseguirás los datos de un lawnstring del servidor
pt: Obtém dados de servidor de Lawnstrings
vi: Thông qua giải mã Compiled-Text, nhận được thông tin từ lawnstring server
zh: 通过编译文本解码，从lawnstring服务器获取数据

source: PopCap Compiled-Text: Encode
es: PopCap Compiled-Text: Codificar
pt: PopCap Compiled-Text: Codificar
vi: PopCap Compiled-Text: Mã Hoá
zh: PopCap Compiled-Text: 编码

# popcap_compiled_text_encode_subtitle
source: Through Compiled-Text Encode, compress data for lawnstring server
es: Conseguirás datos comprimidos de un lawnstring del servidor
pt: Comprime dados para o servidor de Lawnstrings
vi: Thông qua mã hoá Compiled-Text, nén thông tin cho lawnstring server
zh: 通过编译文本编码，为执法服务器压缩数据

source: PopCap Render-Effects: Decode
es: PopCap Render-Effects: Decodificar
pt: PopCap Render-Effects: Decodificar
vi: PopCap Render-Effects: Giải Mã
zh: PopCap Render-Effects: 解码
