Repository: Haruma-VN/Sen
Catalog: Engine/lib/l10n/app_*.arb
Languages: es, pt, vi, zh

# popcap_render_effects_decode_subtitle
source: Through Render-Effects Decode, popfx can be viewed as JSON
es: Conseguirás un popfx que podrás verlo como JSON
pt: Converte um POPFX para JSON, maioritariamente para visualizar a animação
vi: Thông qua giải mã Render-Effects, popfx có thể xem bằng JSON
zh: 通过Render Effects Decode，popfx可以被视为JSON

source: PopCap Render-Effects: Encode
es: PopCap Render-Effects: Codificar
pt: PopCap Render-Effects: Codificar
vi: PopCap Render-Effects: Mã hoá
zh: PopCap Render-Effects: 编码

# popcap_render_effects_encode_subtitle
source: Through Render-Effects Encode, popfx encoded from JSON
es: Conseguirás un popfx codificado usando un JSON
pt: Converte um JSON para POPFX, para poder ser utilizado no jogo
vi: Thông qu mã hoá Render-Effects, popfx được mã hoá từ JSON
zh: 通过Render Effects Encode，popfx从JSON编码

# home
source: App Settings
es: Ajustes de la aplicación
pt: Definições do App
vi: Cài đặt ứng dụng
zh: 应用程序设置

source: Architecture
es: Arquitectura
pt: Arquitetura
vi: Kiến trúc
zh: 结构

source: Current platform
es: Plataforma actual
pt: Plataforma atual
vi: Nền tảng hiện tại
zh: 当前平台

source: Theme
es: Tema
pt: Tema
vi: Chủ đề
zh: 主题

source: Switch current theme
es: Cambiar tema
pt: Mudar tema atual
vi: Chuyển chủ đề hiện tại
zh: 切换当前主题

source: Light
es: Claro
pt: Claro
vi: Sáng
zh: 明

source: Dark
es: Oscuro
pt: Escuro
vi: Tối
zh: 暗

source: Library
es: Libreria
pt: Biblioteca
vi: Thư viện
zh: 资料

# current_workspace
source: Current workspace directory
es: Directorio de trabajo actual
pt: Diretório de trabalho atual
vi: Thư viện hoạt động hiện tại
zh: 当前工作区目录

source: Miscellaneous
es: Misceláneos
pt: Miscelânea
vi: Linh tinh
zh: 混合

source: Storage Permission
es: Permisos de almacenamiento
pt: Armazenamento
vi: Quyền truy cập kho dữ liệu
zh: 存储权限

# storage_permission_for_android
source: Storage Permission access to write/read file
es: Permite escribir/leer archivos
pt: Permitir que Sen possa ler e escrever ficheiros
vi: Quyền để viết/đọc tệp tin
zh: 写入/读取文件的存储权限

source: Granted
es: Dado
pt: Permitido
vi: Đã cho phép
zh: 已授予

source: Denied
es: Denegado
pt: Negado
vi: Từ chối
zh: 拒绝

source: Allow Notification
es: Permitir notificaciones
pt: Notificações
vi: Cho phép thông báo
zh: 允许通知

# allow_notification_subtitle
source: Allow send notification when finish
es: Permite enviar notificaciones al terminar
pt: Permitir que Sen envie notificações quando terminar a execução de uma função
vi: Cho phép gửi thông báo khi hoàn tất
zh: 完成时允许发送通知

# copyright_sen
source: Copyright Â© 2023 Haruma-VN. This software is distributed under the terms of the GNU General Public License v3
es: Copyright © 2023 Haruma-VN. This software is distributed under the terms of the GNU General Public License v3
pt: Copyright © 2023 Haruma-VN. Este software é distribuído sob os termos da Licença Pública Geral GNU v3.0
vi: Bản quyền © 2023 Haruma-VN. Chương trình này được phân phối dưới bản quyền GNU General Public License v3
zh: Copyright © 2023 Haruma-VN. 本软件根据 GNU General Public License v3

# sen_subtitle
source: Bring Vietnamese technology across overseas
es: Dando tecnología vietnamita al extranjero
pt: Trazendo tecnologia vietnamita além-mares
vi: Mang công nghệ Vietnamese vươn tầm quốc tế
zh: 将越南技术带到海外

source: About
es: Acerca de
pt: Sobre
vi: Thông tin
zh: 关于

# about_this_tool
source: More information about this respiratory
es: Más información de este repositorio
pt: Mais informações sobre este respirador
vi: Thêm thông tin về dự án
zh: 有关此系统的更多信息

source: Language
es: Lenguaje
pt: Idioma
vi: Ngôn ngữ
zh: 语言

# current_language
source: Change current language
es: Cambiar lenguaje
pt: Alterar o idioma atual
vi: Thay đổi ngôn ngữ hiện tại
zh: 更改当前语言

source: English
pt: Inglês
vi: Tiếng Anh
zh: 英语

source: Vietnamese
pt: Vietnamita
vi: Tiếng Việt
zh: 越南语

source: Translator
es: Traductor
pt: Tradutor
vi: Người dịch
zh: 翻译

source: Dark Mode
es: Modo oscuro
pt: Tema Escuro
vi: Chủ đề tối
zh: 暗模式

source: Platform
es: Platforma
pt: Plataforma
vi: Nền tảng
zh: 平台

source: Input library path
es: Ingresar directorio de la libreria
pt: Insira o caminho da Biblioteca
vi: Nhập đường dẫn thư viện
zh: 输入路径

# new_language_will_be_applied_after_the_application_is_restarted
source: New language will be applied once the application is restarted
es: El lenguaje escogido será aplicado al reiniciar
pt: O novo idioma será aplicado assim que a aplicação for reiníciada
vi: Ngôn ngữ mới sẽ được áp dụng khi ứng dụng khởi động lại
zh: 应用程序重新启动后将应用新语言

source: Russian
pt: Russo
vi: Tiếng Nga
zh: 俄语

source: Browse
es: Navegador
pt: Pesquisar
vi: Thêm
zh: 浏览

# enter_path
source: Enter path or browse path here
es: Ingrese un directorio o un directorio de navegador aquí
pt: Insira um caminho ou pesquise um caminho aqui
vi: Nhập đường dẫn hoặc thêm vào đây...
zh: 在此处输入路径或浏览路径

source: Output Directory
es: Directorio de salida
pt: Diretório de Saída
vi: Thư mục ra
zh: 输出目录

source: Data File
es: Datos del archivo
pt: Ficheiro de Dados
vi: Tệp dữ liệu
zh: 数据文件

source: Input Directory
es: Directorio de entrada
pt: Diretório de Entrada
vi: Thư mục vào
zh: 输入目录

source: Output File
es: Archivo de salida
pt: Ficheiro de Saída
vi: Tệp ra
zh: 输出文件

source: Command execute success.
es: El comando se ejecutó con éxito.
pt: Comando executado com sucesso. Tempo Decorrido: {time}
vi: Lệnh thực thi hoàn tất.
zh: 命令执行成功。

# command_execute_error
source: Command execute error. Exception found: {exception}
es: Error de ejecución del comando. Excepción encontrada: {exception}
pt: Erro na execução do comando. Excepção encontrada: {exception}
vi: Lệnh thực thi thất bại. Ngoại lệ: {exception}
zh: 命令执行错误。发现异常：{exception}

source: Execute
es: Ejecutar
pt: Executar
vi: Thực thi
zh: 处理

source: Does not have permission
es: No tiene permisos
pt: Permissão ausente
vi: Không có quyền
zh: 没有权限

# does_not_have_permission_subtitle
source: Sen does not have the permission to write/read file in the sdcard, please allow the permission to access the file system on Android
es: Sen no tiene permiso de escribir/leer archivos en la sdcard, permita el acceso de archivos en Android
pt: Sen não tem permissão para ler/escrever ficheiros no sdcard. Por favor forneça a permissão para que possa acessar o sistema de ficheiros do Android
vi: Sen không có quyền viết/đọc tệp tin trong sdcard, hãy cho phép quyền truy cập trên Android
zh: Sen没有在SD卡中写入/读取文件的权限，请允许访问Android上的文件系统

source: Grant Permission
es: Permiso dado
pt: Conceder Permissão
vi: Cấp quyền
zh: 授予权限

# grant_permission_subtitle
source: Click here to open Settings, and allow permission for Sen to access file system on Android
es: Haz clic aquí para abrir Ajustes, y dé permiso de acceder a los archivos en Android
pt: Clica aqui para abrir Definições, e permitir que Sen acesse o sistema de ficheiros do Android
vi: Ấn vào đây để mở Cài đặt và cho phép Sen truy cập hệ thống tệp tin trên Android
zh: 单击此处打开“设置”，并允许Sen访问Android上的文件系统

# execution_argument
source: Execution Argument: {argument}
es: Argumento de ejecución: {argument}
pt: Argumento de Execução: {argument}
vi: Thực thi đối số: {argument}
zh: 执行参数: {argument}

# using_popcap_resource_path
source: Using PopCap's Resources Path
es: Usar path de Resources de PopCap
pt: Caminho de PopCap's Resources
vi: Sử dụng PopCap's Resources Path
zh: 使用PopCap的资源路径

# using_popcap_resource_path_subtitle
source: From version 10.4, PvZ2 has two path style represent for older and newer versions
es: Desde la 10.4, PvZ2 ha tenido 2 estilos de path para versiones antiguas y nuevas
pt: A partir da versão 10.4, PvZ2 tem dois diferentes tipos de caminhos
vi: Từ phiên bản 10.4, PvZ2 có 2 kiểu đường dẫn đại diện cho phiên bản cũ và mới
zh: 从10.4版本开始，PvZ2有两种路径样式，分别代表旧版本和新版本

# old_version_path
source: For 10.3 or below
es: Para la 10.3 ó inferior
pt: Para 10.3 ou abaixo
vi: Cho bản 10.3 hoặc thấp hơn
zh: 10.3或更低

# new_version_path
source: For 10.4 or above
es: Para la 10.4 ó superior
pt: Para 10.4 ou acima
vi: Cho bản 10.4 hoặc cao hơn
zh: 10.4或以上

# old_version_path_subtitle
source: Using Array of String for path
es: Usar lista de texto para el path
pt: Caminho em formato de vetor de strings
vi: Sử dụng mảng sâu cho đường dẫn
zh: 使用字符串数组作为路径

# new_version_path_subtitle
source: Using String for path
es: Usar texto para el path
pt: Caminho em formato Windows
vi: Sử dụng sâu cho đường dẫn
zh: 使用字符串作为路径

source: Split Method
es: Método de separación
pt: Método de Separação
vi: Phương pháp tách
zh: 拆分方法

# split_method_subtitle
source: Split Method will allows you to split with multiple kinds, which allows to work with resources simpler
es: Esto te permitirá separar de diferente manera, lo cual te permite trabajar de manera simple con resources
pt: O Método de Separação vai permitir que tu separes um spritesheet de várias formas, o que permite trabalhar com Resources muito mais facilmente
vi: Phương pháp tách cho phép bạn tách nhiều loại, giúp đỡ bạn sửa đổi resources đơn giản hơn
zh: 拆分方法将允许您使用多种类型进行拆分，这样可以更简单地使用资源

# split_by_path
source: Split by last item name in property "path"
es: Separar por el último texto de la lista en la propiedad "path"
pt: Separar pelo último nome na propriedade "path"
vi: Tách bằng tên của phần tử cuối trong thuộc tính "path"
zh: 根据属性中的姓氏将地图拆分为精灵 "path"

# split_by_path_subtitle
source: Simple filename
es: Nombre de archivo simple
pt: Criará ficheiros com nomes simples, mas é bastante bugado com o PvZ 2 Chinês
vi: Tên tệp tin đơn giản
zh: 简单文件名

# split_by_id
source: Split by property "id"
es: Separar por la propiedad "id"
pt: Separar pela propriedade "id"
vi: Tách bằng thuộc tính "id"
zh: 按属性将贴图集拆分为精灵 "id"

# split_by_id_subtitle
source: Long filename, works with all cases
es: Nombre de archivo largo, funciona con todos los casos
pt: Criará ficheiros com nomes mais longos, e funciona com todos os casos possíveis
vi: Tên dài, hoạt động tất cả trường hợp
zh: 长文件名，适用于所有情况

source: Select width
es: Seleccione ancho
pt: Selecionar largura
vi: Chọn chiều rộng
zh: 选择宽度

# select_width_subtitle
source: Select width to merge atlas
es: Seleccione ancho para juntar atlas
pt: Selecione a largura para unir o atlas
vi: Chọn chiều rộng để hợp nhất atlas
zh: 选择宽度以合并图集

source: Select height
es: Seleccione altura
pt: Selecionar altura
vi: Chọn chiều cao
zh: 选择高度

# select_height_subtitle
source: Select height to merge atlas
es: Seleccione altura para juntar atlas
pt: Selecione a altura para unir o atlas
vi: Chọn chiều cao để hợp nhất atlas
zh: 选择高度以合并图集

source: Select padding
es: Seleccione relleno
pt: Selecionar espaçamento
vi: Chọn căn lề
zh: 选择填充

# select_padding_subtitle
source: Select distance between two sprites
es: Seleccione la distancia entre 2 sprites
pt: Selecione a distância entre sprites
vi: Chọn căn lề giữa 2 sprites
zh: 选择两个单元格之间的距离

source: Use 64-bit variant
es: Usar variante 64-bit
pt: Utilizar variante 64-bit
vi: Sử dụng biến thể 64-bit
zh: 使用64位

# true_argument
source: Set the default argument to true
es: Establecer el argumento predeterminado en verdadero
pt: Definir o argumento como verdadeiro
vi: Đặt đối số hiện tại là đúng
zh: 将默认参数设置为true

# false_argument
source: Set the default argument to false
es: Establecer el argumento predeterminado en falso
pt: Definir o argumento como falso
vi: Đặt đối số hiện tại là sai
zh: 将默认参数设置为false

# most_popcap_games_using_non_64bit
source: Most PopCap Games on Android using 32-bit variant
es: La mayoriá de los juegos de PopCap en Android, usan 32-bits
pt: A maioria dos jogos da PopCap no Android utiliza a variante 32-bit
vi: Đa số Games của PopCap trên Android sử dụng biến thể 32-bit
zh: Android上大多数使用32位的PopCap游戏

# true_val
source: true
es: verdadero
pt: verdadeiro
vi: Đúng
zh: 真

# false_val
source: false
es: falso
pt: falso
vi: Sai
zh: 假

# cannot_merge_with_oversized
source: Cannot merge with oversized image
es: No se puede juntar con imágenes con resolucion super grande
pt: Não é possível unir com imagens muitos grandes
vi: Không thể hợp nhất với ảnh tràn kích thước
zh: 无法与超大图像合并

source: Flash Animation Resize
es: Cambiar de resolución a Animación Flash
pt: Redimensionar Animação Flash
vi: Điều chỉnh kích thước hoạt ảnh Flash
zh: Flash动画调整大小

# originally_is_1200
source: Scale or Downscale to fits actual resolution
es: Cambia de resolución para que concuerde
pt: Aumentar ou reduzir para ajustar para uma resolução utilizável
vi: Tăng hoặc Giảm để vừa khớp kích thước thực tế
zh: 缩放或缩小以适应实际分辨率

source: Encryption Key
es: Llave de encripción
pt: Chave de Encriptação
vi: Khoá mã hoá
zh: 加密密钥

source: Search
es: Buscar
pt: Procurar
vi: Tìm kiếm
zh: 搜索

source: Build version
es: Versión
pt: Versão de Build
vi: Bản dựng
zh: 构建版本

source: No Internal
es: No interno
pt: Nenhum Internal
vi: Không có Internal
zh: 无 Internal

source: Architecture is not supported
es: La arquitectura no es soportado
pt: Arquitetura não é suportada
vi: Nền tảng không được hỗ trợ
zh: 不支持体系结构

source: Failed to load data
es: Fallo al cargar datos
vi: Xử lý dữ liệu thất bại
zh: 未能加载数据

source: Invalid resource type
es: Tipo de resource inválido
pt: Tipo de Resource inválido
vi: Loại tài nguyên không hợp lệ
zh: 无效的资源类型

source: Unknown
es: Desconocido
pt: Desconhecido
vi: Không biết
zh: 未知

# lawnstring_text_test_error
source: Lawnstrings text error, array size must be a number can divide to two
es: Error de texto en Lawnstrings, el tamaño del arreglo debe ser un número que se pueda dividir por 2
pt: Erro de texto de Lawnstrings, o tamanho do array tem de ser um número divisível por 2
vi: Lawnstrings văn bản lỗi, kích thước mảng phải là một số chia hết cho 2
zh: Lawnstrings文本错误，数组大小必须是一个可以一分为二的数字

source: Unknown Method
es: Método desconocido
pt: Método Desconhecido
vi: Không biết phương thức
zh: 未知方法

source: Unknown group type
es: Tipo de grupo desconocido
pt: Tipo de group desconhecido
vi: Loại group chưa định nghĩa
zh: 未知组类型

source: Invalid version
es: Versión inválida
pt: Versão inválida
vi: Phiên bản không hợp lệ
zh: 无效版本

source: Unknown Resource Type
es: Tipo de resource inválido
pt: Tipo de Resource desconhecido
vi: Loại Tài nguyên không xác định
zh: 未知资源类型

# invalid_animation_magic
source: Invalid PAM Magic, should be 0xBAF01954
es: PAM Magic inválido, debería ser 0xBAF01954
pt: Número mágico de PAM inválido, deveria ser 0xBAF01954
vi: PAM Magic không hợp lệ, phải là 0xBAF01954
zh: 无效的PAM模块，应该是 0xBAF01954

# invalid_animation_version
source: Invalid PAM version, should be in range 1 to 6
es: Versión de PAM inválida, debería estar en rango de 1 a 6
pt: Versão de PAM inválida, deveria estar no intervalo de 1 a 6
vi: Phiên bản PAM không hợp lệ, phải nằm trong khoảng từ 1 đến 6
zh: 无效的PAM版本，应在范围内 1 -> 6

source: Invalid transform size
es: Tamaño de transformación inválida
vi: Kích thước biến đổi không hợp lệ
zh: 无效的转换大小

source: error
pt: erro
vi: lỗi
zh: 错误

# invalid_rton_version
source: Invalid RTON version, should be version 1
es: Versión de RTON inválido, debería ser 1
pt: Versão de RTON inválida, deveria ser version = 1
vi: Phiên bản RTON không hợp lệ, phải là phiên bản 1
zh: RTON版本无效，应为版本 1

# invalid_rton_end
source: Invalid RTON ending, should ends with "DONE"
es: Final de RTON inválido, debería terminar en "DONE"
pt: Final de RTON inválido, deveria acabar com "DONE"
vi: Kết thúc RTON không hợp lệ, phải kết thúc bằng "DONE"
zh: RTON结束无效，应以结尾 "DONE"

# invalid_rton_array_end
source: Invalid RTON Array ending
es: Final de arreglo de RTON inválido
pt: Final de Array RTON inválido
vi: Kết thúc mảng tront RTON không hợp lệ
zh: RTON阵列结束无效

source: Invalid Bytecode
es: Bytecode inválido
pt: Bytecode inválido
vi: Mã bytecode không hợp lệ
zh: 字节码无效

source: Invalid RTID
es: RTID inválido
pt: RTID inválido
vi: RTID không hợp lệ
zh: RTID无效

source: offset
vi: vị trí
zh: 抵消

source: path
es: directorio
pt: caminho
vi: đường dẫn
zh: 路径

source: Invalid Value Type
es: Tipo de valor inválido
pt: Tipo de Valor inválido
vi: Loại giá trị không hợp lệ
zh: 无效的值类型

# invalid_rsb_version
source: Invalid RSB version, should be 3 or 4
es: Versión de RSB inválida, debería ser 3 ó 4
pt: Versão de RSB inválida, deveria ser 3 ou 4
vi: Phiên bản RSB không hợp lệ, phải là 3 hoặc 4
zh: RSB 版本无效，应为 3 或 4

source: Invalid File List Offset
es: Offset de lista de archivos inválida
pt: Offset de Lista de Ficheiros inválido
vi: Vị trí danh sách tệp không hợp lệ
zh: 无效文件列表偏移

# invalid_rsb_ver_3_resource_offset
source: Invalid Resource Offset for RSB version 3
es: Offset de resource inválido para RSB de versión 3
pt: Resource Offset inválido para RSB versão 3
vi: Vị trí tài nguyên không hợp lệ cho RSB phiên bản 3
zh: RSB 版本 3 的资源偏移量无效

source: Invalid Composite Name
es: Nombre de Composite inválido
pt: Nome de Composite inválido
vi: Tên Composite không hợp lệ
zh: 无效的复合名称

# out_of_range_1
source: Out of range for poolIndex
es: El poolIndex está fuera de rango
pt: Fora do alcance para poolIndex
vi: Vượt ra khỏi phạm vi cho poolIndex
zh: 超出范围 poolIndex

# out_of_range_2
source: Out of range for packet index
es: El packet index está fuera de rango
pt: Fora do alcance para index de packet
vi: Vượt ra khỏi phạm vi cho chỉ số gói tin
zh: 超出范围 packet index

source: Invalid RSG Name
es: Nombre de RSG inválido
pt: Nome de RSG inválido
vi: Tên RSG không hợp lệ
zh: 无效的RSG名称

source: Invalid Packet Width
es: Ancho de Packet inválido
pt: Largura de Packet inválida
vi: Chiều rộng Packet không hợp lệ
zh: 数据包宽度无效

source: Invalid Packet Height
es: Altura de Packet inválido
pt: Altura de Packet inválida
vi: Chiều cao Packet không hợp lệ
zh: 数据包高度无效

source: Invalid Item Packet
es: Ítem de Packet inválido
pt: Item de Packet inválido
vi: Vật phẩm Packet không hợp lệ
zh: 无效的项目数据包

# invalid_rsg_number
source: Invalid RSG index
es: Index de RSG inválido
pt: Index de RSG inválido
vi: Chỉ số RSG không hợp lệ
zh: 无效的RSG索引

source: Invalid Part2 Offset
es: Part2 Offset inválido
pt: Part2 Offset inválido
vi: Vị trí Phần 2 không hợp lệ
zh: 无效的第2部分偏移

source: Invalid Head Length
es: Longitud de cabecera inválido
pt: Head Length inválido
vi: Chiều dài Đầu không hợp lệ
zh: 磁头长度无效

# rsb_is_corrupted
source: This RSB is corrupted
es: Este RSB está corrupto
pt: Este RSB está corrompido
vi: RSB này bị hỏng
zh: 此RSB已损坏

# invalid_ptx_info_eachlength
source: PTX Info is invalid
es: La info. del PTX es inválida
pt: PTX Info está inválido
vi: Thông tin PTX không hợp lệ
zh: PTX信息无效

source: Invalid End Offset
es: End Offset inválido
pt: Offset Final inválido
vi: Vị trí kết thúc không hợp lệ
zh: 无效的结束偏移

# invalid_rsb_head
source: Mismatch RSB magic, should starts with "1BSR"
es: Magia RSB no coincidente, debería empezar con "1BSR"
pt: Número mágico de RSB inválido, Deveria começar com "1BSR"
vi: Không khớp magic RSB, phải bắt đầu bằng "1BSR"
zh: 错配RSB模块，应该从: "1BSR"

# invalid_ptx_info_each_length
source: Invalid PTX Info
es: Información de PTX no válida
pt: PTX Info inválido
vi: Thông tin PTX không hợp lệ
zh: 无效的PTX信息

# category_out_of_length
source: Category is out of length
es: Category está fuera de longitud
pt: Categoria está fora do comprimento
vi: Danh mục vượt quá độ dài
zh: 类别过长

# name_path_must_be_ascii
source: Name path must match ASCII
es: La ruta del nombre debe coincidir con ASCII
pt: Caminho do nome tem de ser ASCII
vi: Tên đường dẫn phải dùng bảng mã ASCII
zh: 名称路径必须与ASCII匹配

source: is not the same
es: no es lo mismo
pt: não é o mesmo
vi: không giống nhau
zh: 不同

source: In Manifest
es: En Manifest
pt: Em Manifest
vi: Trong Manifest
zh: 在Manifest

# in_rsg
source: In RSGFile
es: En archivo RSG
pt: No Ficheiro RSG
vi: Trong Tệp RSG
zh: 在RSGFile

source: RSG Path
es: Directorio RSG
pt: Caminho do RSG
vi: Đường dẫn RSG
zh: RSG路径

# invalid_rsg_magic
source: Invalid RSG Magic, should starts with "PGSR"
es: RSG Magic inválido, debería de empezar con "PGSR"
pt: Número mágico de RSG inválido, deveria começar com "PGSR"
vi: Mã RSG không hợp lệ, phải bắt đầu bằng "PGSR"
zh: 无效的RSG模块，应以开头: "PGSR"

# invalid_rsg_version
source: Invalid RSG version, should be 3 or 4
es: Versión de RSG inválida, debería ser 3 ó 4
pt: Versão de RSG inválida, deveria ser 3 ou 4
vi: Phiên bản RSG không hợp lệ, phải là 3 hoặc 4
zh: RSG 版本无效，应为 3 或 4

# invalid_rsg_compression_flag
source: Invalid RSG Compression flag, only 0 to 3 is supported
es: Flag de compresión RSG inválida, solo 0 a 3 es soportado
pt: Flag de Compressão de RSG inválida, só 0 a 3 é suportada
vi: Cờ Nén RSG không hợp lệ, chỉ hỗ trợ từ 0 đến 3
zh: RSG压缩标志无效，仅支持0到3

# pvrtc_can_only_compress_square_dimension
source: PVRTC can only compress a square image
es: PVRTC solo puede comprimir una imagen cuadrada
pt: PVRTC só pode comprimir imagens quadradas
vi: PVRTC chỉ có thể nén hình ảnh vuông
zh: PVRTC只能压缩方形图像

# mismatch_zlib_magic
source: Mismatch PopCap Zlib magic, should begins with 0xDEADFED4, received
es: PopCap Zlib Magic no coincide, debería comenzar con 0xDEADFED4, se recibió
pt: Número mágico de PopCap Zlib não corresponde, deveria começar com 0xDEADFED4, recebido
vi: Magic Zlib PopCap không khớp, phải bắt đầu bằng 0xDEADFED4, nhận
zh: 不匹配的PopCap Zlib模块，应该以开头: "0xDEADFED4", 收到

# invalid_bnk_magic
source: Invalid Soundbank magic, should starts with "BKHD"
es: Soundbank magic inválida, debería de empezar con "BKHD"
pt: Número mágico de Soundbank inválido, deveria começar com "BKHD"
vi: Magic Soundbank không hợp lệ, phải bắt đầu bằng "BKHD"
zh: 无效的声音库魔法，应该以 "BKHD"开头

# non_supported_bnk_version
source: Unsupported Soundbank version, only 88, 112, 140 and 145 are supported
es: Versión de Soundbank no soportado, solo se acepta 88, 112, 140 y 145
pt: Versão de Soundbank não suportada. Só há suporte de decodificação à versões 88, 112, 140 e 145
vi: Phiên bản Soundbank không được hỗ trợ, chỉ hỗ trợ 88, 112, 140 và 145
zh: 不支持的声音库版本，仅支持 88、112、140 和 145

source: Invalid BNK Reader
es: BNK Reader inválido
pt: BNK Reader inválido
vi: Đọc BNK không hợp lệ
zh: 无效的BNK读取器

source: Unsupported fxpr
es: fxpr no soportado
pt: Fxpr não suportado
vi: fxpr không được hỗ trợ
zh: 不支持的fxpr

source: Invalid BNK in Offset:
es: BNK inválido en Offset:
pt: BNK inválido em Offset:
vi: Vị trí Đầu vào BNK không hợp lệ:
zh: 偏移中的BNK无效:

source: Invalid Data Bank Section
es: Data Bank Section inválido
pt: Secção de Data Bank inválido
vi: Phần Dữ liệu Bank không hợp lệ
zh: 无效的数据库部分

source: Missing bank header
es: Bank header no encontrado
pt: Bank Header ausente
vi: Thiếu tiêu đề bank
zh: 缺少银行标题

# invalid_bnk
source: Invalid Soundbank
es: Soundbank inválido
pt: Soundbank inválido
vi: Soundbank không hợp lệ
zh: Soundbank无效

source: Invalid Volume Threshold
es: Volume Threshold inválido
pt: Limite de Volume inválido
vi: Ngưỡng âm lượng không hợp lệ
zh: 无效的卷阈值

# invalid_max_voice_instances
source: Invalid Max Voice Instance
es: Max Voice Instance inválido
pt: Máximo de instâncias de voz inválido
vi: Số lượng thể hiện tối đa không hợp lệ
zh: 无效的最大语音实例

source: Invalid Default Transition Time
es: Default Transition Time inválido
pt: Tempo de Transição Padrão inválido
vi: Thời gian chuyển đổi mặc định không hợp lệ
zh: 无效的默认转换时间

source: Invalid Parameter data
es: Parameter data inválido
pt: Informação de parâmetro inválida
vi: Dữ liệu tham số không hợp lệ
zh: 无效的参数数据

# buffer_size_must_larger_than_64
source: Buffer size must be larger than 64.0M
es: El tamaño del Buffer debería ser más largo que 64.0M
pt: Tamanho do buffer tem de ser maior do que 64.0M
vi: Kích thước bộ đệm phải lớn hơn 64.0M
zh: 缓冲区大小必须大于64.0M

# resource_size_zero
source: Property "resources" must have size 0 with composite
es: La propiedad "resources" debería tener tamaño 0 con composite
pt: Property "resources" tem de ter size 0 com composite
vi: Thuộc tính "resources" phải có kích thước bằng 0 với composite
zh: 属性“resources”的大小必须为0，并带有复合
