Repository: Haruma-VN/Sen
Catalog: Material/lib/l10n/app_*.arb
Languages: vi

# command_page
source: Commands
vi: Lệnh

# setting_page
source: Settings
vi: Tuỳ Chỉnh

source: Have not implemented
vi: Chưa cải thiện

source: PopCap Resource-Group: Split
vi: PopCap Resource-Group: Tách

# popcap_resource_group_split_subtitle
source: This function will help you split resources.json to a directory
vi: Hàm này sẽ giúp bạn tách resources.json thành thư mục

source: PopCap Resource-Group: Merge
vi: PopCap Resource-Group: Gộp

# popcap_resource_group_merge_subtitle
source: This function will give you resources.json from a directory
vi: Hàm này sẽ giúp bạn gộp resources.json từ thư mục

source: PopCap Resource-Group: To Res-Info
vi: PopCap Resource-Group: Sang Res-Info

# popcap_resource_group_to_resinfo_subtitle
source: Through Res-Info, editing resources simpler
vi: Thông qua Res-Info, sửa đổi tài nguyên đơn giản hơn

source: PopCap Resource-Group: From Res-Info
vi: PopCap Resource-Group: Từ Res-Info

# popcap_resource_group_from_resinfo_subtitle
source: After edit Res-Info, must merge to Resource-Group before launch
vi: Sau khi sửa Res-Info, phải hợp nhất thành Resource-Group trước khi chạy

source: PopCap Res-Info: Split
vi: PopCap Res-Info: Tách

# popcap_resinfo_split_subtitle
source: This function will help you split res.json to a directory
vi: Hàm này sẽ giúp bạn tách res.json thành thư mục

source: PopCap Res-Info: Merge
vi: PopCap Res-Info: Gộp

# popcap_resinfo_merge_subtitle
source: This function will give you res.json from a directory
vi: Hàm này sẽ giúp bạn gộp res.json từ thư mục

# popcap_resource_group_split_atlas
source: PopCap Atlas: Split with Resource-Group Structure
vi: PopCap Atlas: Tách với cấu trúc Resource-Group

# popcap_resource_group_split_atlas_subtitle
source: Through split atlas, obtain sprite directory to work with
vi: Thông qua tách atlas, nhận được thư mục sprite để làm việc

# popcap_resource_group_merge_atlas
source: PopCap Atlas: Merge with Resource-Group Structure
vi: PopCap Atlas: Hợp nhất với cấu trúc Resource-Group

# popcap_resource_group_merge_atlas_subtitle
source: Through merge atlas, obtain working spritesheet in-game
vi: Thông qua hợp nhất, nhận được spritesheet chạy trong game

# popcap_resinfo_split_atlas
source: PopCap Atlas: Split with Res-Info Structure
vi: PopCap Atlas: Tách với cấu trúc Res-Info

# popcap_resinfo_split_atlas_subtitle
source: Through split atlas, obtain sprite directory to work with
vi: Thông qua tách atlas, nhận được thư mục sprite để làm việc

# popcap_resinfo_merge_atlas
source: PopCap Atlas: Merge with Res-Info Structure
vi: PopCap Atlas: Hợp nhất với cấu trúc Res-Info

# popcap_resinfo_merge_atlas_subtitle
source: Through merge atlas, obtain working spritesheet in-game and json
vi: Thông qua hợp nhất, nhận được spritesheet chạy trong game và tệp json
